import math
a = 45
r = a * 3.14 / 180.0       # 도 -> 라디안
print(r) # 0.785 출력됨

r = a * math.pi / 180.0    # 도 -> 라디안
print(r) # 0.7853981633974483 출력됨

r = math.radians(a)        # 도 -> 라디안
print(r) # 0.7853981633974483 출력됨

print(math.sin(r), math.cos(r)) # 0.7071067811865476 0.7071067811865476 출력됨



r = 1
a = r * 180.0 / 3.14       # 라디안 -> 도
print(a) # 57.324840764331206 출력됨

a = r * 180.0 / math.pi    # 라디안 -> 도
print(a) # 57.29577951308232 출력됨

a = math.degrees(r)        # 라디안 -> 도
print(a) # 57.29577951308232 출력됨